#include <stdio.h>
#define N 9

void ninep (char b[], int a);

int main ()
{
    int c, i=0;
    char s[240]=" ";
    while((c=getchar())!=EOF)
    {
        s[i]=c;
        i++;
    }
    putchar('\n');
    ninep(s, i);

}

void ninep (char b[], int a)
{
    int j=0;
    for (int i=0; i<a; i++)
    {
        j++;
        // Заменяем табы на 2 пробела и соответственно расширяем массив.
        if (b[i]=='\t')
        {
            b[i]=' ';
            for (int k=a; k>i; k--)
            {
                b[k]=b[k-1];
            }
            a++;
        }
        // Переносы, с конца строчки и сначала на 2 символа.
        if ((b[i+1]!=' ' && j==9) && (b[i+2]==' ' || b[i+2]=='\0'))
        {
            putchar(' ');
            j++;
        }
        if ((b[i]==' ' && j==8) && (b[i+1]!=' ' || b[i+1]=='\0'))
        {
            putchar(' ');
            j++;
        }
        //Вставляем знаки переноса и новые строчки, обнуляем счетчик.
        if (j>N && b[i-1]!='\n')
        {
            if ((b[i]!=' ' && b[i-1]!=' ') && (b[i]!='\n'))
            {
                putchar('-');
            }
            putchar('\n');
            j=1;
        }
        else if (j>N || b[i-1]=='\n')
        {
            j=1;
        }
        // Работаем с пробелами в начале каждой строки.
        if (b[i]==' ' && j==1)
        {
            while (b[i]==' ')
            {
                i++;
            }
        }
        putchar(b[i]);
    }
    putchar('\n');
}



/* Печать, где новые строки становятся пробелами, текст выглядит более комплексно, вставить в строку 61-62
        if (b[i]=='\n')
        {
            b[i]=' ';
        } */